Radiacion/Case-ViewFactor-Ra90000-test3/0/qr
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;


boundaryField
{
    frontAndBack
    {
        type         empty;
        
    }

    right
    {
        type            greyDiffusiveRadiationViewFactor;
        qro             uniform 0;
           
    }

    left
    {
        type            greyDiffusiveRadiationViewFactor;
        qro             uniform 0;
        
    }

    hot
    {
        type            greyDiffusiveRadiationViewFactor;  
        qro             uniform 0;
        
    }

    cold
    {
        type            greyDiffusiveRadiationViewFactor;
        qro             uniform 0;
        
    }
}

// ************************************************************************* //
