Radiacion/Case-ViewFactor-Ra90000-test3/0/viewFactorField
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      viewFactorField;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cold
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.954779
0.954779
0.987142
0.987142
0.991855
0.991855
0.99477
0.99477
...
)
;
    }
    hot
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.954779
0.954779
0.987142
0.987142
0.991855
0.991855
0.99477
0.99477
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.954779
0.954779
0.987142
0.987142
0.991855
0.991855
0.99477
0.99477
...
)
;
    }
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.954779
0.954779
0.987142
0.987142
0.991855
0.991855
0.99477
0.99477
...
)
;
    }
}


// ************************************************************************* //
